/*某地出租车的收费方法如下:起步价7元，最多可行驶3千米(不包含3千米);
3~8千米(不包含8千米)按1.7元/千米计算(不足1千米,按1千米计算),8千米以后
按2.0元/千米计算(不足1千米,按1千米计算)。编写程序,输入所行驶里程数,
计算并输出车费。*/
#include<stdio.h>
int main()
{
	double distance,fee;
	printf("请输入千米数:");
	scanf("%lf",&distance);
	if(distance<=0)
		printf("抱歉,出错!");
	else{
		if(distance<3) fee=7;
		else if(distance<8) fee=7+(int)(distance-2)*1.7;
		else fee=7+5*1.7+(int)(distance-7)*2.0;
		printf("您的出租车费用为:%8.2lf元.\n",fee);
	}
	return 0;
} 
/*
请输入千米数:0
抱歉,出错!
请输入千米数:2
您的出租车费用为:    7.00元.
请输入千米数:3.2
您的出租车费用为:    8.70元.
请输入千米数:7.8
您的出租车费用为:   15.50元.
请输入千米数:8.2
您的出租车费用为:   17.50元.
*/
